{
    "name": "British Raj in India",
    "founder": "East India Company (later British Crown)",
    "capital": "Calcutta (until 1911 CE), then Delhi",
    "period": "1757–1947 CE",
    "image": "images/DALL·E 2025-03-06 10.00.00 - A highly realistic depiction of the British Raj in India, showcasing the grand Victoria Memorial in Calcutta, British officers in red uniforms and Indian sepoys in khaki, set against the backdrop of a bustling colonial market. The scene captures the 1857 rebellion and the dramatic contrast of Indian natural beauty under a sunset..webp",
    "sections": [
        {
            "title": "The Rise of the British Raj in India",
            "content": [
                "The British Raj in India began with the East India Company’s (EIC) decisive victory at the Battle of Plassey on June 23, 1757 CE, near Murshidabad in Bengal. Led by Robert Clive, the EIC’s force of 3,000 soldiers—900 British, 2,000 Indian sepoys, and 8 cannons—defeated the 50,000-strong army of Bengal’s Nawab Siraj-ud-Daulah, which included 15,000 cavalry and 50 French cannons. The battle, lasting six hours, saw Siraj’s commander Mir Jafar betray him, resulting in only 500 British and 5,000 Bengali casualties. Siraj fled on July 2, 1757 CE, and was later executed.",
                "The EIC, established on December 31, 1600 CE, with a charter from Queen Elizabeth I and 215 shareholders, had set up trading posts in Surat (1612 CE, with 50 merchants), Madras (1639 CE, Fort St. George), Bombay (1668 CE, acquired from the Portuguese), and Calcutta (1690 CE, Fort William). By 1700 CE, the EIC exported 150,000 pounds of cotton, 80,000 pounds of pepper, and 20,000 pounds of indigo annually, generating £1 million in revenue. The victory at Plassey granted the EIC the Diwani rights (revenue collection authority) over Bengal, Bihar, and Orissa through the Treaty of Allahabad on August 12, 1765 CE, signed with Mughal Emperor Shah Alam II at Clive’s Buxar camp. This gave the EIC control over 10 million people and 100,000 square miles, yielding an annual revenue of £1.2 million.",
                "The EIC plundered Bengal’s treasury, extracting £50 million in gold, silver, and jewels, of which £15 million was invested in British textile mills by 1780 CE, fueling the Industrial Revolution’s steam engines. The 1773 Regulating Act appointed Warren Hastings as the first Governor-General, who governed 30 million people from Calcutta by 1780 CE. Calcutta then had a population of 250,000, 60 colonial mansions, 30 indigo factories, and 20 opium warehouses. Hastings’ 1774 judicial reforms established 25 district courts and appointed 50 British magistrates, while his 1781 revenue system assessed 50 million acres, collecting £1.8 million but imposing a 50% tax increase on 10 million farmers.",
                "In 1793 CE, Lord Cornwallis’ Permanent Settlement fixed Bengal’s land tax at £1 million, affecting 50 million farmers, of whom 10 million lost their land by 1800 CE due to inability to pay. On September 23, 1803 CE, during the Second Anglo-Maratha War, General Arthur Wellesley defeated the Scindia forces at Assaye, killing 6,000 Marathas and annexing Orissa, Gujarat, and Bundelkhand, adding 120,000 square miles. The Battle of Koregaon in 1818 CE, with 5,000 casualties, brought Maharashtra under EIC control. On February 21, 1849 CE, during the Second Anglo-Sikh War, 15,000 Sikhs surrendered at Gujarat, and Punjab was annexed, giving the EIC control over 60% of India and laying the foundation for direct British Crown rule after the 1857 rebellion."
            ],
            "image": "images/battle_of_plassey.webp"
        },
        {
            "title": "Expansion and Conflicts",
            "content": [
                "The British Raj expanded through strategic military campaigns and diplomacy, controlling 1.6 million square miles and 220 million people, including 600 princely states, by 1857 CE. On October 23, 1764 CE, at the Battle of Buxar near Patna, Hector Munro’s 7,000 British troops defeated the combined 40,000-strong army of Mughal Emperor Shah Alam II, the Nawab of Awadh Shuja-ud-Daulah, and Mir Qasim, killing 10,000 enemies and 2,000 British soldiers. This victory secured £2.5 million in taxes and 80,000 square miles.",
                "The First Anglo-Mysore War (1767–1769 CE) against Hyder Ali ended with the Treaty of Madras on April 4, 1769 CE, maintaining the status quo after 3,000 deaths. However, in the Fourth Anglo-Mysore War (1799 CE), Wellesley’s 4,000 troops attacked Srirangapatnam on May 4, 1799 CE, killing Tipu Sultan and 9,000 defenders, seizing £1.2 million, 600 cannons, and 50 war elephants, and annexing 50,000 square miles of Mysore.",
                "The First Anglo-Maratha War (1775–1782 CE) concluded with the Treaty of Salbai on May 17, 1782 CE, after 6,000 deaths. The Second Anglo-Maratha War (1803–1805 CE) saw Wellesley defeat Scindia and Bhonsle at Assaye on September 23, 1803 CE, and Laswari on November 1, 1803 CE, killing 6,000 Marathas and annexing 150,000 square miles. In the First Anglo-Sikh War (1845–1846 CE), the Battle of Sobraon on February 10, 1846 CE, resulted in 12,000 Sikh and 2,000 British deaths, with Kashmir sold for £750,000. The Second Anglo-Sikh War (1848–1849 CE) ended on February 21, 1849 CE, at Gujarat, where 20,000 Sikhs surrendered, and Punjab was annexed.",
                "The Sepoy Mutiny of 1857 CE began on May 10 in Meerut, led by Mangal Pandey, triggered by the use of cow and pig fat in Enfield rifle cartridges. Eighty-five sepoys rebelled, and 60,000 soldiers captured Delhi on May 11, 1857 CE, under Bahadur Shah Zafar, killing 2,500 British. The British recaptured Delhi on September 20, 1857 CE, executing 5,000 rebels, including Zafar’s sons Mirza Mughal and Khizr Sultan. In Jhansi, Rani Lakshmibai killed 500 British at Gwalior on June 18, 1858 CE, but 12,000 rebels were killed. The rebellion caused 100,000 deaths, leading to the Government of India Act on November 1, 1858 CE, making Queen Victoria the Empress of India and Lord Canning the first Viceroy, governing 260 million people, 600 princely states, and a 1.2 million-strong army. By 1860 CE, 60,000 miles of telegraph lines connected 250 cities."
            ],
            "image": "images/sepoy_mutiny.webp"
        },
        {
            "title": "Administration and Military Prowess",
            "content": [
                "After 1858 CE, the British Raj established a structured colonial administration, transitioning from EIC rule to direct Crown governance, managing 320 million people across 1.9 million square miles by 1910 CE. The Viceroy governed from the Government House in Calcutta until 1911 CE, then from the Viceroy’s House (now Rashtrapati Bhavan) in Delhi. The Indian Civil Service (ICS), with 1,200 British officers by 1910 CE, oversaw 600 districts, each with 60,000 villages, collecting £9 million in land tax from 120 million acres (40% of revenue), of which 50% was reinvested in Britain.",
                "The 1861 Indian Councils Act established 60-member legislative councils, with 20 Indian members by 1900 CE. The Permanent Settlement of 1880 CE fixed Bengal’s tax at £2.5 million, affecting 60 million farmers, of whom 20 million lost land by 1910 CE due to a 70% tax burden. The British Indian Army grew to 1.8 million by 1945 CE, including 400,000 British soldiers, 1.2 million Indian sepoys, 100,000 Gurkhas, and 1,200 artillery units with 600 cannons, supported by 250 forts like Fort William in Calcutta, which had 70-foot walls, a 35-foot moat, 25 granaries (120,000 tons of grain), and housing for 5,000 soldiers.",
                "Military strategies like ‘divide and rule’ exacerbated Hindu-Muslim tensions, leading to 1,000 communal riots by 1940 CE. The ‘enfilade fire’ tactic at Sobraon in 1846 CE killed 8,000 Sikhs. The 1878 Vernacular Press Act banned 400 newspapers and seized 50 printing presses, while the 1919 Rowlatt Act led to 15,000 warrantless arrests, including 5,000 in Punjab, fueling Gandhi’s 1920 non-cooperation movement. By 1910 CE, the British built 50,000 miles of railways at a cost of £300 million, transporting 70 million passengers and 6 million tons of goods annually, and 80,000 miles of canals irrigating 30 million acres, though 80% of profits went to British projects like the £20 million Suez Canal in 1875 CE.",
                "The police force had 250,000 officers by 1920 CE, while 600 princely states like Hyderabad and Mysore contributed £6 million annually, each maintaining 1,000 soldiers under British Residents while retaining autonomy. The 1909 Morley-Minto Reforms introduced 100 elected seats with 50% Muslim representation, sowing communal discord. By 1935 CE, 90% of ICS officers remained British, shaping India’s bureaucracy, with 70% of its structure adopted in the post-1947 civil service and the 1950 Constitution’s federal framework."
            ],
            "image": "images/viceroys_house_delhi.webp"
        },
        {
            "title": "Economy and Trade",
            "content": [
                "The British Raj transformed India’s economy into a colonial extraction system, fueling Britain’s Industrial Revolution, impacting 320 million people across 2 million square miles by 1910 CE. Agriculture, employing 75% of the population, produced 25 million tons of rice, 18 million tons of wheat, 6 million tons of cotton, 3 million tons of tea, and 2 million tons of jute annually by 1910 CE. Assam and Darjeeling exported 120 million pounds of tea, earning £12 million and funding 60% of Britain’s tea industry, with 1 million workers on 5,000 estates.",
                "A 50% tax on 200 million acres generated £12 million, but the Great Famine of 1876–1878 CE caused 6 million deaths, including 1.5 million in Madras from starvation, as 90% tax hikes and drought led to the export of 1 million tons of rice. The 1899–1900 famine killed 3 million, with 500,000 in Bombay Presidency, due to 70% grain exports. Trade was dominated by Britain, with exports of £25 million in cotton, £6 million in jute, £4 million in opium, and £2 million in indigo by 1910 CE, earning £60 million, while £12 million in British textile imports (£150 million spent) destroyed India’s handloom industry, leaving 6 million weavers in poverty by 1890 CE, with 1 million looms abandoned.",
                "The EIC’s opium trade peaked at 7,000 tons by 1860 CE, generating 25% of British India’s budget, addicting 1.5 million Chinese and involving 500,000 Indian farmers cultivating poppy on 1 million acres. Infrastructure included 50,000 miles of railways by 1910 CE, costing £350 million, transporting 80 million passengers and 7 million tons of goods, and 90,000 miles of canals irrigating 35 million acres, though 90% of profits went to British companies like the £20 million Tata Steel contract in 1905 CE.",
                "The British minted 600 million silver rupees with Queen Victoria’s image, circulated in 1,200 markets, with Calcutta’s mint producing 3 million coins monthly and 50 mints issuing 100 million copper paisa. Between 1757 and 1947 CE, £12 trillion was extracted, with £5 trillion invested in London’s infrastructure. India’s per capita income fell 60% to ₹18 by 1947 CE, but railways and tea plantations contributed 20% to India’s 1950 GDP growth."
            ],
            "image": "images/british_trade_india.webp"
        },
        {
            "title": "Culture and Arts",
            "content": [
                "The British Raj profoundly reshaped India’s cultural landscape, blending colonial influences with Indian traditions, impacting 320 million people across 2 million square miles by 1910 CE. The 1835 English Education Act, led by Lord Macaulay, established 300 English-medium schools by 1860 CE, educating 80,000 students. Universities in Calcutta, Bombay, and Madras (founded in 1857 CE) produced 15,000 graduates by 1910 CE, including Rabindranath Tagore, who won the Nobel Prize in 1913 CE for *Gitanjali*, translated into 50 languages by 1920 CE.",
                "The 1904 Ancient Monuments Preservation Act protected 1,200 monuments, including the Taj Mahal and Qutb Minar, with 600 sites restored. The Sanchi Stupa restoration employed 1,000 workers, while 250 museums, like the Indian Museum in Calcutta (1814 CE), housed 60,000 artifacts, including 6,000 Mughal paintings and 5,000 Ashokan relics, attracting 500,000 annual visitors by 1920 CE. Colonial architecture included the Victoria Memorial in Calcutta (1921 CE), with 25 galleries, 3,500 exhibits, and 1.2 million annual visitors, and New Delhi’s 1911 design by Edwin Lutyens, completed in 1931 CE with 320 buildings, 60 miles of roads, 1,200 arches, and 50,000 workers.",
                "Indian art saw a revival through the Bengal School in 1850 CE, led by Abanindranath Tagore, which rejuvenated 600 miniature painting styles. In Orissa, 1,200 Pattachitra artists produced 12,000 scrolls annually, while 500 Kalighat painters in Calcutta created 10,000 pat paintings by 1900 CE. Literature flourished with 6,000 English novels translated into Hindi, Tamil, and Bengali. Bankim Chandra Chattopadhyay’s *Anandamath* (1882 CE) inspired 60,000 freedom fighters, with 1,000 copies of *Vande Mataram* sung at 500 gatherings.",
                "Music blended British marches with Indian ragas, with 1,200 bands performing at 500 durbars by 1910 CE, while qawwali and thumri thrived in 600 princely states, with 5,000 annual performances. Fashion saw 6 million urban Indians adopt Western suits by 1930 CE, though 85% of rural Indians retained kurtas, dhotis, phulkari saris, and 50 embroidered sherwanis. Tea culture emerged, with 30 million families consuming 120 million cups by 1947 CE, alongside biryani, jalebi, and samosas sold at 12,000 street stalls with 1 million tea vendors.",
                "Social reforms included the 1829 Sati abolition, saving 12,000 widows by 1910 CE, and the 1856 Widow Remarriage Act, enabling 5,000 marriages. Over 600 newspapers, like *The Times of India* (1838 CE), reached 150,000 readers by 1910 CE, fueling nationalist sentiments that persist in modern education (300 million English speakers) and heritage tourism (£25 billion revenue)."
            ],
            "image": "images/victoria_memorial.webp"
        },
        {
            "title": "The Decline of the British Raj",
            "content": [
                "The decline of the British Raj intensified with the Jallianwala Bagh massacre on April 13, 1919 CE, in Amritsar, where General Reginald Dyer ordered 50 British soldiers to fire 1,650 rounds in 10 minutes at 15,000 unarmed protesters in a 7-acre park, killing 1,800 and injuring 2,500. This sparked nationwide protests by 70,000 people and resignations by 1 million from British posts.",
                "The partition of Bengal on October 16, 1905 CE, by Lord Curzon, divided 85 million people into East and West Bengal, igniting the Swadeshi Movement. Over 1.5 million boycotted British goods, burning £600,000 worth of textiles, boosting Indian handlooms by 25% to produce 1 million yards by 1910 CE. The Indian National Congress (INC), founded on December 28, 1885 CE, by Allan Octavian Hume with 72 delegates, saw Bal Gangadhar Tilak’s 1907 Surat Split unite 600,000 for Swaraj, while Gopal Krishna Gokhale’s moderates secured 50 seats in the 1909 reforms.",
                "Gandhi’s 1919 Non-Cooperation Movement saw 6 million burn £1.2 million in British textiles, closing 600 courts and 1,000 schools, with 50,000 arrests by 1921 CE. The Salt Satyagraha from March 12 to April 6, 1930 CE, saw Gandhi march 240 miles from Sabarmati to Dandi, with 80,000 protesters producing £1 million in illegal salt, challenging the £12 salt tax, leading to 120,000 arrests and 5,000 beatings.",
                "The 1935 Government of India Act granted voting rights to 30 million, but 500 princely states and 1 million subjects protested. The Quit India Movement on August 8, 1942 CE, involved 12 million, with 600,000 arrests, 6,000 deaths, and the destruction of 1,200 railway stations and 500 post offices, paralyzing governance. During World War II (1939–1945 CE), 2.5 million Indian soldiers fought, with 90,000 deaths, while the 1943 Bengal Famine killed 5 million due to 90% rice exports (2 million tons), despite a 1 million-ton local shortage, sparking 1 million protests.",
                "The naval mutiny in Bombay on February 18, 1946 CE, involved 25,000 sailors, 80 ships, and 600 strikes, spreading to 1.5 million workers, with 500 clashes and 1,000 arrests, pressuring Clement Attlee to exit. The Indian Independence Act of July 18, 1947 CE, partitioned India and Pakistan, ending British rule on August 15, 1947 CE. This led to 18 million displaced, 1.5 million deaths in riots, and 5 million refugees. Lord Mountbatten, the last Viceroy, transferred governance of 350 million people and £1 trillion in assets to the Indian government."
            ],
            "image": "images/jallianwala_bagh.webp"
        },
        {
            "title": "Legacy of the British Raj",
            "content": [
                "The British Raj’s multifaceted legacy shapes modern India’s political, economic, and cultural framework, impacting 400 million people across 2 million square miles by 1947 CE and 1.4 billion today. The 1858 Government of India Act’s administrative structure, with 600 districts and 1,200 ICS officers, influenced the 1950 Constitution, with 75% of its federal framework, including a bicameral parliament with 545 Lok Sabha seats, governing 1.4 billion in 2023 CE.",
                "The 50,000-mile railway network, transporting 1.2 billion passengers in 2023 CE, and 90,000 miles of canals irrigating 40 million acres, form an economic backbone, with 85% of freight on railways and 20% of agriculture via canals, generating £30 billion in revenue. English education, with 250 universities by 1947 CE, produced 1.2 million graduates like Jawaharlal Nehru and B.R. Ambedkar, shaping 95% of the civil service, with 350 million English speakers and 500,000 English-medium schools in 2023 CE.",
                "The British Indian Army’s 2.5 million WWII soldiers, including 5,000 Victoria Cross recipients, laid the foundation for today’s 1.4 million-strong army. However, the ‘divide and rule’ policy fueled Hindu-Muslim tensions, contributing to the 1947 partition, displacing 18 million, killing 1.5 million, and creating 5 million refugees, with 50% of the Kashmir conflict rooted in this division.",
                "Culturally, the 1904 Ancient Monuments Act preserved 2,500 sites like Sanchi and Ajanta Caves, attracting 6 million annual visitors, while 600 museums with 120,000 artifacts generate £30 billion from heritage tourism in 2023 CE. *The Times of India* (1838 CE), with 2.5 million readers in 2023 CE, birthed modern journalism, with 1,200 dailies and 100,000 journalists. Economic exploitation extracted £15 trillion, with £6 trillion invested in 19th-century London railways, but tea plantations (2.5 million jobs) and jute (1.2 million tons, £6 billion in exports) remain economic pillars.",
                "Social reforms like the 1829 Sati abolition saved 15,000 widows by 1920 CE, the 1856 Widow Remarriage Act enabled 6,000 marriages, and the 1860 Penal Code, with 500 sections, still applies to 1.4 billion. The freedom struggle, with Gandhi’s 6 million-strong movements, inspired global non-violence, influencing Martin Luther King Jr.’s 1960 civil rights and Nelson Mandela’s anti-apartheid movements, with 85% of India’s 2023 democratic narrative rooted in British-era resistance."
            ],
            "image": "images/indian_independence.webp"
        }
    ]
}