{
    "name": "Chola Dynasty",
    "founder": "Vijayalaya Chola",
    "capital": "Thanjavur, Gangaikonda Cholapuram",
    "period": "c. 9th - 13th Century CE",
    "image": "images/chola dy cover.webpp",
    "sections": [
        {
            "title": "Rise of the Cholas",
            "content": "The Chola Dynasty emerged as a significant power in South India during the 9th century, marking the beginning of a remarkable era in Tamil history. The dynasty was founded by Vijayalaya Chola around 848 CE, who captured the city of Thanjavur from the Muttaraiyar chieftains, a vassal state under the Pallavas. Vijayalaya, originally a feudatory of the Pallavas, seized the opportunity during a period of political instability to establish Chola dominance in the region. His victory laid the foundation for the dynasty’s expansion, transforming Thanjavur into a thriving capital. Vijayalaya’s successors, notably Aditya I (c. 871–907 CE), furthered this expansion by defeating the Pallava king Aparajita Varman, annexing the Tondaimandalam region (modern-day northern Tamil Nadu). Aditya I also challenged the Pandyas, extending Chola influence southward. Parantaka I (c. 907–955 CE), Aditya’s son, continued this legacy by consolidating power and launching military campaigns against the Pandyas and Sri Lanka, briefly capturing the northern part of the island. However, his reign faced a significant setback at the Battle of Takkolam in 949 CE, where the Cholas were defeated by the Rashtrakuta king Krishna III, temporarily halting their expansion. Despite this loss, Parantaka I’s successors worked to regain lost territories, setting the stage for the Chola golden age under later rulers like Rajaraja Chola I. The early Chola rulers demonstrated strategic military prowess and administrative foresight, which were crucial in transforming the Cholas from a regional power into a dominant empire that would eventually influence much of South India and beyond.",
            "image": "data/ok.webp"
        },
        {
            "title": "The Golden Age: Rajendra Chola I",
            "content": "Rajendra I (26 July 971 – 1044), often referred to as Rajendra the Great, was a Chola Emperor who reigned from 1014 to 1044. He was born in Thanjavur to Rajaraja I. His queen was Vanavan Mahadevi and he assumed royal power as co-regent with his father in 1012 until his father died in 1014, when Rajendra ascended to the Chola throne. During his reign, the Chola Empire reached its zenith in the Indian subcontinent; it extended its reach via trade and conquest across the Indian Ocean, making Rajendra one of only a few Indian monarchs who conquered territory beyond South Asia. In his early years, Rajendra was involved in the Chola Army, with which he fought in several campaigns against the Western Chalukyas and the rulers of Anuradhapura, earning him his first victories. He quelled rebellions in the Chera and Pandiya vassal states, and in Sri Lanka. As Emperor, Rajendra completed the conquest of Anuradhapura and brought a large portion of Sri Lanka under imperial rule. Rajendra expanded Chola rule by defeating the kingdoms of Kalinga and Vengai, and subduing the islands of Laccadives and the Maldives, which he renamed Munnir Palantivu Pannirayiram ('Twelve Thousand Islands and the Ocean Where Three Waters Meet'). These islands were later used as strategic naval bases. During his South-East Asia campaign, he annexed Srivijaya, Kedah, Tambralinga and Pegu, achieving imperial dominance in the region and strengthening Indian influence in Southeast Asia. Rajendra conducted a war against the Pala dynasty and captured a great deal of wealth, which he used to build the city of Gangaikondacholapuram, the capital of the Chola Empire, and one of the centers of trade and commerce in the empire for several centuries. The city was remarkable for its artificial lake, extensive fortifications, moats surrounding the imperial palace, and the Brihadisvara Temple. Rajendra was a follower of Shaivism but welcomed Buddhism and built several stupas across South-East Asia and South India. New forms of trade emerged during Rajendra's reign such as the commercial system called 'emporia,' this was after the Chola's had gained control of Strait of Malacca and several other coastal areas. Emporia refers to exporting goods according to their demand, arose, making trade within the Empire profitable and helped maintain the Chola military. The Khmer Empire was a major ally and trading partner, and helped the Cholas expand their networks as far as Song China. This link allowed Rajendra to incorporate Chinese vessels into the Chola military. These networks also extended west; the Cholas engaged in the spice trade with Arabia, North Africa, Anatolia and Turkic peoples. Rajendra Chola I was succeeded by his son Rajadhiraja I, who ruled from 1044 to 1054. Early life and ascension: The exact birth date of Rajendra I is unknown; it is speculated he was born around 971 CE. He was the son of Rajaraja I and queen Vanathi, who is also called Thiripuvāna Mādēviyār. Rajendra had a younger brother named Araiyan Rajarajan, who became a commanding general of a Chola army, and at least three sisters; the younger sister was Kundavai (not to be confused with Kundavai Pirattiyar), the queen of Chalukya-Vimaladitya; and a daughter called Mahadevi. Other significant members of the royal household include queen mother Dantisakti Vitanki—alias Lokamahadevi. The nakshatra of Rajendra's birth was Thiruvathirai (Ardra). Rajendra was declared heir apparent and formally associated with his father in the administration of the Chola Empire in the final years of his father's reign (1012–1014). In 1018, Rajendra appointed his son Rajadhiraja as heir apparent or co-regent to the Chola throne, which Rajadhiraja occupied from 1018 to 1044.",
            "image": "data/rajendra.webp"
        },
        {
            "title": "Administration & Military Power",
            "content": "Military conquests: The Chola Empire at its greatest extent c. 1030, under Rajendra I. On his father's behalf Rajaraja I, Rajendra I started his wars on the Indian mainland when he was a co-regent for his father in an expedition in 1012 with the capture of Aduthurai in modern-day central Tamil Nadu and Vanavasi in western Tamil Nadu. He then directed his attention to Kollipaakkai in northern Andhra Pradesh and captured it in 1013. In 1014, Rajendra led a war against the Irratiapaadi ElaraIiakam in northern Karnataka and southern Maharashtra. He also captured its capital city Mannaikadakkam or Maleked on behalf of his father, which met this reversal after its initial capture by Rajaraja Cholan in 1006. With the death of Rajaraja Cholan I in 1014 CE and the ascension of Rajendra to the Chola throne in the same year. After a lapse of two years, in 1016, Rajendra sent a naval force to Sri Lanka and brought the Anuradhapura Kingdom under his control. Following an expedition to eastern Kerala in 1017, Rajendra captured Kudamalai Nadu. In 1018, Rajendra's forces captured the Maldives and Lakshadweep islands, and the same year captured Sandimaaththivu, the Kavaratti island west of Kerala. In 1019, Rajendra sent another expedition against the Irrataipaadi Elaraiillakam, northern Karnataka and southern Maharashtra. With its new capital at Kalyani in northernmost Karnataka, which the Cholas lost again but recaptured after a battle at Musangi in eastern Karnataka. After a two-year lapse, Rajendra, with his capture of many regions of the Indian mainland, became more ambitious in conquering the northern and north-western parts of India. He commenced his war expedition in this direction in 1021, capturing Sakkarakkoattam in the south of Chhattisgarh. Then, he sent part of his forces to the Ganges river in the north and the other in a north-westerly direction. At the same time, he stationed himself at Sakkarakkoattam until the two expeditions were complete. The second expedition went to Uttarapatha and Gangetic region countries towards the Ganges river in the north from Sakkarakkoattam; they captured the regions of Odda Vishayam and Thandabuththi in Odisha, Kosala Naadu in northern Chhattisgarh, Thakkana Laadam and Uttara Laadam in Jharkhand, and Vangala Desam in modern-day Bangladesh, and reached the Ganges. The Chola Indian Mainland expedition ended in 1022, and details of the countries conquered by his forces in the expedition were included in his Meikeerthi's from 1023. With the return of Rajendra Chola's forces to the Chola capital in 1022, the Royal Guru of Rajendra, Isaana Pandithar, built Gangaikonda Cholaeswarer temple at Kulampandel, Tamil Nadu. With his return, Rajendra claimed a new title, 'Gangaikondaan', and gave the title 'Gangaikonda Cholan' (the Chola who captured Gangai) to his younger brother, who led the Gangetic expedition. Rajendra commenced the construction of a new city named 'Gangaikonda Cholapuram', with a new Siva temple named 'Gangaikonda Cholaeswarem' and a large temple water tank called 'Chola Gangam', where the holy water brought from the Ganges river was mixed. The Essalam Copper Plates of Rajendra state with the conquest of the Gangetic region, Rajendra constructed the new city of the Gangaikonda Cholapuram, the great Gangaikonda Choleswarer temple, and the sacred Cholagangam Tank at the Udaiyar Palaiyam region of Ariyalur district. In the temple 'Gangaikonda Cholaeswarem' he built, the presiding deity of the Karuvarai (Sanctum Sanctorum) called the 'Gangaikonda Cholaeswarer' also known as 'Peruvudaiyar' – the God Siva in the form of Lingam, the biggest Lingam among the Siva Temples in the world over, having a height of 13 feet (4.0 m) and a circumference of 20 ft (6.1 m). The praśasti mentions Rajendra's conquests: On the third Regnal year of Rajendra Chola – the conqueror of the East country, Ganges and Kadaram; this stone inscription was made to record the tax exemption grant given by Rajendra, the one who surrendered to Shiva.",
            "image": "data/administration.webp"
        },
        {
            "title": "Economy & Trade",
            "content": "The Chola economy was agriculture-based with advanced irrigation systems. They exported rice, spices, textiles, and pearls, trading with China, the Abbasid Caliphate, and Southeast Asia.",
            "image": "data/economy.webp"
        },
        {
            "title": "Art, Architecture & Culture",
            "content": "The Cholas built architectural marvels like the Brihadeeswarar Temple in Thanjavur, Gangaikonda Cholapuram Temple, and Airavatesvara Temple in Darasuram. They are renowned for bronze sculptures, especially the Nataraja (Shiva as the cosmic dancer), and encouraged Tamil literature with inscriptions providing historical records.",
            "image": "data/art.webp"
        },
        {
            "title": "Decline of the Cholas",
            "content": "The Cholas faced conflicts with the Chalukyas, Hoysalas, and Pandyas. They were weakened due to the Chalukya-Chola Wars and internal instability, with a final defeat by the Pandyas in 1279 CE marking the end of Chola rule.",
            "image": "data/decline.webp"
        },
        {
            "title": "The Chola Legacy",
            "content": "The Cholas set benchmarks in administrative governance for future South Indian dynasties. They expanded Indian Ocean trade networks and influenced Tamil culture and temple architecture across Southeast Asia.",
            "image": "data/legacy.webp"
        },
        {
            "title": "Religious Practices",
            "content": "The Cholas were devout Shaivites, supporting the Bhakti movement. Temples were central to community life, hosting festivals and charity.",
            "image": "data/religious.webp"
        },
        {
            "title": "Social Structure",
            "content": "Chola society was hierarchical, with Brahmins and Vellalars prominent. Women had some roles in temple management.",
            "image": "data/SOCIAL.webp"
        },
        {
            "title": "Cultural Influence in Southeast Asia",
            "content": "Chola naval campaigns spread Tamil culture to Southeast Asia, influencing temple architecture in Indonesia and Cambodia.",
            "image": "data/culture.webp"
        },
        {
            "title": "Naval Power and Trade Routes",
            "content": "The Chola navy dominated the Indian Ocean, securing trade routes with China, Arabia, and Southeast Asia.",
            "image": "data/navel.webp"
        },
        {
            "title": "Bronze Sculptures in Detail",
            "content": "Chola bronze sculptures, like the Nataraja, were made using the lost-wax technique, symbolizing cosmic balance.",
            "image": "data/bronze.webp"
        },
        {
            "title": "Literature and Inscriptions",
            "content": "The Cholas patronized Tamil literature, with works like the Kamba Ramayanam. Inscriptions on temples provide historical insights.",
            "image": "data/lit.webp"
        },
        {
            "title": "Irrigation and Agriculture",
            "content": "The Cholas developed advanced irrigation systems along the Kaveri River, supporting rice cultivation and economic growth.",
            "image": "data/irr.webp"
        },
        {
            "title": "Chola Military Strategies",
            "content": "The Chola military used war elephants and a strong navy, enabling both land and sea conquests.",
            "image": "data/mili.webp"
        },
        {
            "title": "Decline: Chalukya-Chola Wars",
            "content": "The Chalukya-Chola Wars drained Chola resources, weakening their hold on the Deccan.",
            "image": "data/wars.webp"
        },
        {
            "title": "Decline: Pandya Resurgence",
            "content": "The Pandyas overthrew the Cholas in 1279 CE, capturing Thanjavur and ending their dynasty.",
            "image": "images/pandya.jpg"
        },
        {
            "title": "Decline: Internal Challenges",
            "content": "Succession disputes and feudal rebellions contributed to the Chola decline.",
            "image": "images/chola_rebellions.webp"
        },
        {
            "title": "Legacy: Architectural Influence",
            "content": "Chola temples influenced Dravidian architecture, inspiring later dynasties like Vijayanagara.",
            "image": "images/dravidian_architecture.webp"
        },
        {
            "title": "Legacy: Maritime Impact",
            "content": "The Chola navy’s trade routes shaped Indian Ocean commerce, influencing global trade.",
            "image": "images/chola_maritime.webp"
        },
        {
            "title": "Ellalan’s Invasion of Sri Lanka",
            "content": "The Mahavamsa mentions that a Chola prince known as Ellalan invaded the Rajarata kingdom of Sri Lanka and conquered it in 235 BCE with the help of a Mysore army.",
            "image": "images/ellalan.webp"
        },
        {
            "title": "Origin",
            "content": [
                "There is very little written evidence for the Cholas before the 7th century CE.",
                "The main sources of information about the early Cholas are ancient Tamil literature of the Sangam period (c. 600 BCE), oral traditions, religious texts, temple and copperplate inscriptions.",
                "Later medieval Cholas also claimed a long and ancient lineage. The Cholas are mentioned in Ashokan Edicts (inscribed 273 BCE–232 BCE) as one of the Mauryan empire's neighbours to the South (Ashoka Major Rock Edict No.13), who, though not subject to Ashoka, were on friendly terms with him. There are also brief references to the Chola country and its towns, ports and commerce in the Periplus of the Erythraean Sea (Periplus Maris Erythraei), and in the slightly later work of the geographer Ptolemy. Mahāvaṃsa, a Buddhist text written down during the 5th century CE, recounts several conflicts between the inhabitants of Sri Lanka and Cholas in the 1st century BCE."
            ],
            "image": "images/sangam_literature.webp"
        },
        {
            "title": "Chola Expansion",
            "content": [
                "During the reign of Rajaraja Chola I and his successors Rajendra Chola I, Virarajendra Chola, and Kulothunga Chola I, the Chola armies invaded Sri Lanka, the Maldives, and parts of Southeast Asia like Malaysia, Indonesia, and Southern Thailand of the Srivijaya Empire in the 11th century.",
                "Rajaraja Chola I launched several naval campaigns that resulted in the capture of Sri Lanka, Maldives, and the Malabar Coast.",
                "In 1025, Rajendra Chola launched naval raids on the ports of Srivijaya and against the Burmese kingdom of Pegu.",
                "A Chola inscription states that he captured or plundered 14 places, which have been identified with Palembang, Tambralinga, and Kedah, among others.",
                "A second invasion was led by Virarajendra Chola, who conquered Kedah in Malaysia of Srivijaya in the late 11th century. The Chola invasion ultimately failed to install direct administration over Srivijaya since the invasion was short and only meant to plunder the wealth of Srivijaya.",
                "However, this invasion gravely weakened the Srivijayan hegemony and enabled the formation of regional kingdoms.",
                "Although the invasion was not followed by direct Cholan occupation and the region was unchanged geographically, there were huge consequences in trade.",
                "Tamil traders encroached on the Srivijayan realm traditionally controlled by Malay traders, and the Tamil guilds' influence increased on the Malay Peninsula and the north coast of Sumatra."
            ],
            "image": "images/srivijaya_raid.webp"
        }
    ]
}