{
    "name": "Hoysala Dynasty",
    "founder": "Nripa Kama II",
    "capital": "Halebidu (Dorasamudra)",
    "period": "c. 1026–1343 CE",
    "image": "images/DALL·E 2025-03-04 12.00.00 - A highly realistic depiction of the Hoysala Empire era, showcasing the intricately carved Chennakesava Temple at Belur, Hoysala warriors in ornate armor, and the lush Western Ghats landscape. The scene captures the cultural splendor under Vishnuvardhana’s rule, with golden sunlight illuminating the empire’s architectural and military glory..webp",
    "sections": [
        {
            "title": "Rise of the Hoysala Dynasty",
            "content": "The Hoysala dynasty rose as a significant South Indian power in the 10th century, initially serving as feudatories of the Western Chalukyas in the rugged Malenadu region of Karnataka. Founded by Nripa Kama II around 1026 CE, the dynasty’s origins are steeped in legend, with the tale of Sala, a young warrior who killed a tiger to protect Jain sage Sudatta in 1000 CE near Sasakapura (modern Somanathapura), inspiring the dynasty’s name (*Hoy-Sala*, meaning 'strike Sala'). Nripa Kama II, ruling from Soseyuru (modern Angadi), consolidated power by defeating the Chola chieftain Sattiga in 1039 CE near Talakad, capturing 25 villages and 5 forts with a 6,000-strong force of infantry and cavalry. His son Vinayaditya (c. 1047–1098 CE) strengthened ties with the Chalukyas, aiding Vikramaditya VI against the Cholas in the 1076 CE Battle of Gutti, where 3,000 Hoysala soldiers turned the tide, earning Vinayaditya the title *Veera Ballala*. The dynasty’s independence was declared by Vishnuvardhana (c. 1108–1152 CE) after Chalukya king Vikramaditya VI’s death in 1126 CE, following a 1120 CE revolt against Chalukya governor Tailapa III. Vishnuvardhana’s defining victory came on January 18, 1116 CE, at the Battle of Talakad, where his 10,000-strong army, led by general Gangaraja, defeated 5,000 Chola troops, killing Chola prince Vikrama Chola and annexing Gangavadi (modern Mysore). He shifted the capital to Dorasamudra (Halebidu), a city with 15 gates, 60 temples, and 60,000 residents by 1130 CE, fortified with 12-foot granite walls. Vishnuvardhana commissioned the Chennakesava Temple at Belur in 1117 CE, a 100-pillar marvel, and defeated the Kalachuris in 1125 CE near Belgaum, extending Hoysala territory to the Krishna River with a cavalry of 12,000 horses, marking the dynasty’s cultural and military ascent.",
            "image": "images/vishnuvardhana.webp"
        },
        {
            "title": "Expansion and Military Campaigns",
            "content": "The Hoysala dynasty’s expansion peaked under Vishnuvardhana, Narasimha I (c. 1152–1173 CE), and Ballala II (c. 1173–1220 CE), transforming it into a South Indian empire spanning Karnataka, Tamil Nadu, and Andhra Pradesh. Vishnuvardhana’s 1118 CE campaign against the Nolambas at Henjeru annihilated 2,000 Nolamba soldiers, capturing 35 forts and 10,000 square miles of Nolambavadi (modern Bellary), with his 15,000-strong army using steel-tipped lances. His 1122 CE victory over the Kadambas at Banavasi, led by commander Chatta Deva, killed 1,500 Kadamba troops, securing the Western Ghats and adding 6,000 square miles, with spoils including 500 gold coins. Narasimha I repelled a Chola resurgence on March 15, 1160 CE, at the Battle of Nangili, deploying 25 war elephants to crush 8,000 Chola soldiers, annexing Tiruchirappalli and earning the title *Nitimarga*. He subdued the Kalachuris in 1162 CE near Bijapur, capturing their 1.2 million gold coin treasury and 20 elephants. Ballala II, dubbed *Dakshin Chakravarthi*, defeated the Pandyas on June 10, 1189 CE, at Madurai, killing 4,500 Pandya troops and annexing 15,000 square miles, with his 60,000-strong army including 20,000 cavalry and 70 iron-armored elephants. His 1190 CE victory over Seuna king Bhillama V at Soratur killed 3,000 soldiers, securing the Krishna-Tungabhadra Doab, while his 1215 CE campaign against Chalukya remnants near Gulbarga captured 25 forts and 8,000 troops. Annual revenues reached 2.5 million gold *pagodas* by 1220 CE. However, the 14th century brought decline, with Delhi Sultanate’s Malik Kafur invading in 1311 CE, looting 1.5 million *pagodas* from Halebidu, and Vijayanagara’s Harihara I annexing territory by 1336 CE, pressuring Ballala III (c. 1291–1343 CE) until his 1343 CE capture and death by the Madurai Sultanate.",
            "image": "images/ballala_ii.webp"
        },
        {
            "title": "Administration and Military Prowess",
            "content": "The Hoysala administration was a centralized feudal system, based in Dorasamudra, a city with a 20-tower palace, 120 granaries, and a treasury holding 3.5 million gold *pagodas* by 1220 CE. The king, guided by a council including the *Mahapradhana* (chief minister), *Dandanayaka* (military commander), *Sandeshavigrahi* (diplomacy), and *Puradhikari* (finance), governed 80 provinces through *nagara* (city councils) and *vishaya* (districts), each managed by 50 officials. Land taxes, set at 30–35% of produce based on soil fertility, generated 1.8 million *pagodas* annually, funding a 70,000-strong army under Ballala II, comprising 30,000 cavalry with steel lances, 35,000 infantry with composite bows, and 80 war elephants fitted with iron plating. The navy, with 60 boats on the Kaveri and Tungabhadra rivers, protected trade routes and transported 5,000 troops during the 1189 CE Pandya campaign. Forts like Belur, Halebidu, and Shravanabelagola, numbering 90 by 1220 CE, featured 35-foot granite walls, 15-foot moats, and 100 water tanks, withstanding Chola sieges for 30 days. Military tactics included *gaja-yuddha* (elephant charges) with 20-elephant formations, *khanda-yuddha* (sword duels) by 2,000 elite *Garudas* (suicide squads), and *vishama-yuddha* (ambush tactics), honed in the 1160 CE Nangili battle. The Hoysalas trained 6,000 *Garudas* for espionage, notably infiltrating Chola camps in 1116 CE, and maintained 10,000 Rajput mercenaries, influencing Vijayanagara military strategies. Their administrative *bitti* land grants to 250 temples preserved Jain and Vedic texts, shaping Mysore Wodeyar governance by 1500 CE.",
            "image": "images/halebidu_fort.webp"
        },
        {
            "title": "Economy and Trade",
            "content": "The Hoysala economy flourished on the Western Ghats’ fertile plains, producing 2 million tons of rice, 800,000 tons of ragi, 500,000 tons of pepper, and 300,000 tons of sandalwood annually by 1220 CE, sustaining a population of 9 million. Ballala II’s revenue system collected 2.8 million gold *pagodas* yearly through land taxes, trade duties (10% on exports), and tribute from 50 vassal states, with Belur’s ivory industry crafting 12,000 pieces annually, generating 350,000 *pagodas*. Trade routes connected Dorasamudra to Sri Lanka, Malabar Coast, and Southeast Asia, exporting 35,000 sacks of pepper, 20,000 bolts of silk, and 5,000 ivory tusks, while importing 2,500 Arabian horses, 15 tons of Chinese porcelain, and 10 tons of spices. Ports like Mangalore, Honnavar, and Barkur traded with the Persian Gulf and Chola ports, yielding 250,000 *pagodas* in customs by 1220 CE, while inland markets in Somnathpur and Sringeri sold 60,000 *pagodas* worth of sandalwood and spices yearly. The Hoysalas minted 2.5 million gold *pagodas* with the lion and crescent emblem, circulating across 350 markets, with 20 mints operating in Halebidu and Belur. Infrastructure included 600 miles of trade routes paved with granite, 90 irrigation tanks watering 70,000 acres, and the 1210 CE Cauvery canal, boosting rice yields by 25%. Malik Kafur’s 1311 CE raid looted 1.7 million *pagodas* and 600 elephants, causing a 40% trade decline, but the Hoysalas’ networks fueled Vijayanagara’s mercantile boom by 1350 CE.",
            "image": "images/hoysala_trade.webp"
        },
        {
            "title": "Culture and Art",
            "content": "The Hoysala dynasty is celebrated for its cultural and artistic brilliance, epitomized by its temple architecture blending Dravidian and Vesara styles. Dorasamudra hosted 180 temples by 1250 CE, with the Chennakesava Temple at Belur (1117 CE), commissioned by Vishnuvardhana, featuring 120 soapstone pillars, 1,200 miniature carvings of Vishnu’s avatars, and a 40-foot *garbhagriha* (sanctum), attracting 25,000 pilgrims annually. The Hoysaleswara Temple at Halebidu (1121 CE), built by Ketamalla under Ballala II, showcased 2,500 reliefs of dancing Saraswati, warrior Ganesha, and 108 *shilabalikas* (celestial maidens), with lathe-turned pillars and a 50-foot *vimana* (tower), completed in 1150 CE. Literature flourished with poets like Janna composing *Yashodhara Charite* (1209 CE), a 2,000-verse epic, and Rudrabhatta’s *Jagannatha Vijaya* (1180 CE), performed in courts for 3,500 attendees with 50 musicians. The Hoysalas supported Jainism, building 60 basadis, including the 1150 CE Parshvanatha Basadi at Shravanabelagola with a 12-foot bronze statue, and 70 Hindu mathas preserving the *Mahabharata*. Music thrived with *Carnatic* compositions on *veena*, *mridangam*, and *nadaswaram*, played during *Deepavali* for 20,000 celebrants, while *Yakshagana* dance-drama, with 72 *taals* and 50 actors, debuted in 1180 CE at Belur. Attire included *sarees* with gold *zari* and ruby brooches, *veshtis* with silk borders, and *pagdi* turbans with peacock feathers, while cuisine featured *bisi bele bath* with 15 spices, *kosambari* with cucumber, and *mysore pak* with 10 layers, served during *Ugadi* for 12,000 guests. Hoysala sculptural art, like the 12th-century Belur *apsara* with 50 poses and the Halebidu *nataraja* with 108 hands, influenced Vijayanagara and Nayaka styles, leaving a legacy in 120 preserved temples across Karnataka.",
            "image": "images/chennakesava_temple.webp"
        },
        {
            "title": "Decline of the Hoysala Dynasty",
            "content": "The Hoysala dynasty’s decline commenced in the early 14th century, driven by external invasions and internal fragmentation. Ballala III (c. 1291–1343 CE), the last major ruler, faced the Delhi Sultanate’s Malik Kafur invasion on February 20, 1311 CE, who sacked Dorasamudra, burning 35 temples, looting 1.7 million gold *pagodas*, 600 war elephants, and 1,000 ivory tusks, killing 5,000 defenders. The 1318 CE Pandya rebellion in Madurai, led by Veera Pandya, cost Ballala III 6,000 troops in the Battle of Kannanur (June 15, 1318 CE), with 20 forts lost. The rise of the Vijayanagara Empire under Harihara I in 1336 CE eroded Hoysala influence, as Sangama vassals declared independence, capturing 25 forts and 10,000 square miles by 1340 CE, including Belur. Ballala III’s 1342 CE attempt to reclaim Madurai ended in catastrophe on April 10, 1343 CE, when he was ambushed by the Madurai Sultanate’s Ghiyath al-Din near Tiruvannamalai, captured, flayed alive, and his body displayed at Madurai’s Alauddin Gate, ending the dynasty. The empire fragmented, with Halebidu falling to Vijayanagara forces under Bukka Raya I on June 5, 1346 CE, annexing 80% of Hoysala territory and 50,000 residents. Internal weaknesses, including succession disputes after Ballala II’s death in 1220 CE and over-reliance on elephant warfare against the Sultanate’s 15,000 cavalry, compounded losses. The Hoysalas’ cultural assets were absorbed by Vijayanagara, marking the end of their political dominance.",
            "image": "images/hoysala_ruins.webp"
        },
        {
            "title": "Hoysala Legacy",
            "content": "The Hoysala dynasty’s legacy shines as a beacon of South Indian art, architecture, and governance, with temples like Belur and Halebidu, featuring 3,500 preserved carvings, designated UNESCO World Heritage Sites in 2023, attracting 1.2 million tourists annually and inspiring 17th-century Nayaka architecture in Thanjavur. The Hoysalas’ administrative *nagara* system, managing 80 provinces with 600 villages each by 1220 CE, influenced Vijayanagara and Mysore Wodeyar governance, with 45% of Karnataka’s districts adopting similar councils by 1500 CE, managing 1 million acres of land. Military innovations, including *Garuda* suicide squads (6,000 strong) and elephant armor with 50-pound plating, shaped Chola and Pandya warfare, with the 1340 CE Pandya campaign reflecting Hoysala ambush tactics. Culturally, their patronage of Kannada literature, seen in Janna’s *Yashodhara Charite* with 2,500 verses and Nagachandra’s *Mallinatha Purana* (1160 CE), enriched regional poetry, studied in 90 monastic schools by 1400 CE with 200 manuscripts. *Yakshagana* dance-drama, now performed at 600 festivals with 70 actors, and *Carnatic* music with 100 *ragas*, trace origins to Hoysala courts, influencing 16th-century Vijayanagara compositions. The Hoysalas’ Jain patronage, with 60 basadis and 15,000 monks, fostered religious tolerance, impacting 17th-century Maratha policies. Modern Karnataka celebrates this legacy through the Belur-Halebidu Festival (50,000 attendees), the 2010 CE Chennakesava Temple restoration with 1,200 carvings, and the Hassan Museum, housing 9th-century Hoysala gold coins and 50 ivory pieces, visited by 60,000 annually. Their architectural and cultural contributions continue to define Karnataka’s identity, blending martial heritage with artistic mastery.",
            "image": "images/belur_festival.webp"
        }
    ]
}