{
    "name": "Maratha Empire",
    "founder": "Chhatrapati Shivaji Maharaj",
    "capital": "Raigad",
    "period": "1674–1818",
    "image": "images/maratha_era.webp",
    "video": "https://www.youtube.com/embed/dQw4w9WgXcQ",
    "sections": [
        {
            "title": "Chhatrapati Shivaji Maharaj",
            "content": "In the shadow of the rugged Sahyadri mountains, a legend was born on February 19, 1630, within the fortified walls of Shivneri Fort. Chhatrapati Shivaji Maharaj, scion of the noble Bhosale clan, emerged from a lineage steeped in martial tradition. His father, Shahaji Bhosale, a seasoned general who served the Adil Shahi Sultanate of Bijapur and later navigated Mughal diplomacy, instilled early military lessons. His mother, Jijabai, daughter of Lakhuji Jadhavrao of Sindkhed, nurtured him with tales of Hindu valor from the Ramayana and Mahabharata, sparking his resistance against foreign rule. At twelve, Shivaji journeyed to Bangalore under Shahaji’s care, where Dadoji Kondadev mentored him in swordsmanship, archery, horsemanship, and statecraft, shaping his strategic genius.\n\nStanding about five feet six inches with piercing eyes and a saffron turban, Shivaji embodied humility and boldness, earning the title *Lokmanya* (friend of the people). His tolerance bridged Hindu and Muslim communities, yet his resolve was unyielding, forging alliances with local chieftains. Wielding the *Bhavani Talwar*—a sword gifted by Jijabai—and the *bagh nakh* (tiger claws), he mastered *ganimi kava* (guerrilla warfare), turning Sahyadri forts into bastions. His navy, launched with over a hundred vessels, guarded coasts from European powers.\n\nHis epic unfolded with the 1645 capture of Torna Fort at fifteen with 300 Mavalis, followed by Kondana and Rajgad in 1647. The 1659 Battle of Pratapgad saw him outwit Afzal Khan with a concealed *bagh nakh*, a victory that echoed across the Deccan. The 1664 raid on Surat enriched his treasury, while the 1670 Treaty of Purandar showcased diplomacy. On June 6, 1674, his coronation at Raigad, officiated by Gaga Bhatt, heralded the Maratha Empire. His 1677 southern campaign reached Tamil Nadu and Karnataka, and 1678 negotiations with the Qutb Shahi dynasty strengthened alliances. Illness claimed him on April 3, 1680, at Raigad, leaving a legacy of sovereignty.\n\nShivaji’s governance innovated with the *Ashta Pradhan* council, abolishing the jizya tax and introducing Chauth and Sardeshmukhi levies. His 300+ forts and ports like Kalyan thrived under local governance. A patron of Marathi and Sanskrit, he commissioned the *Sabhasad Bakhar* and supported poets like Moropant. His 1666 escape from Aurangzeb’s Agra court, disguised as a palanquin bearer, remains a testament to his resourcefulness. His vision as the *Father of the Indian Navy* and a nationalist icon endures.\n\n**Sources**: Sabhasad Bakhar (1697), Grant Duff’s *History of the Mahrattas* (1826), Sarkar’s *Shivaji and His Times* (1919).",
            "image": "images/ch_shivaji_maharaj.jpg"
        },
        {
            "title": "Chhatrapati Sambhaji Maharaj",
            "content": "Born in 1657 at Purandar Fort to Chhatrapati Shivaji Maharaj and Maharani Saibai, Chhatrapati Sambhaji Maharaj was a scholar-warrior, trained in Sanskrit, Marathi, Persian, and political science. His intellect shone in the *Budhbhushan* grantha, a poetic work, while his martial skills were honed under his father’s tutelage. Ascending the throne in 1681 amid internal strife, he faced a relentless Mughal onslaught led by Aurangzeb, defending Hindavi Swarajya for nine years with fierce resolve.\n\nCaptured in 1689 at Sangameshwar through treachery, Sambhaji endured brutal torture—his eyes gouged, tongue severed—refusing to renounce his faith or sovereignty. His martyrdom at Tulapur on March 11, 1689, became a symbol of defiance. Described as tall and imposing with a commanding presence, his reign saw the fortification of key strongholds and naval engagements against the Siddis.\n\nHis administration maintained the *Ashta Pradhan* council, adapting it to wartime needs. He expanded the navy, clashing with Portuguese and Siddi forces, and supported Marathi literature. Anecdotes of his courage, like leading a counterattack despite overwhelming odds, inspire to this day.\n\n**Sources**: Sabhasad Bakhar (1697), Sarkar’s *House of Shivaji* (1940), Kincaid and Parasnis’ *A History of the Maratha People* (1918).",
            "image": "images/ch_sambhaji_maharaj.jpg"
        },
        {
            "title": "Chhatrapati Rajaram Maharaj",
            "content": "Born in 1670 to Chhatrapati Shivaji Maharaj and Soyarabai Mohite, Chhatrapati Rajaram Maharaj grew up amid political intrigue, his mother’s ambitions shaping his early years. Educated in military strategy and governance within Deccan fortresses, his formal training was cut short by his father’s 1680 death and succession disputes. Likely of medium build with a strategic demeanor, Rajaram’s reign was one of survival against Mughal forces.\n\nAscending in 1689 after Sambhaji’s execution, he fled to Jinji, leading resistance from 1690 to 1700. His retreats to Vishalgad and Satara showcased guerrilla tactics, outmaneuvering Aurangzeb’s sieges. Illness claimed him on March 2, 1700, leaving the empire to Tarabai. His administration adapted the *Ashta Pradhan* council, sustaining the war effort with revenue reforms. A lesser-known hero, his resilience preserved Maratha hopes.\n\n**Sources**: Sabhasad Bakhar (1697), Kincaid and Parasnis’ *A History of the Maratha People* (1918).",
            "image": "images/ch_rajaram_maharaj.jpg"
        },
        {
            "title": "Chhatrapati Shahu Maharaj",
            "content": "Born in 1682 to Sambhaji Maharaj and Yesubai Bhosale, Chhatrapati Shahu Maharaj’s early life shifted dramatically when Mughals captured him in 1689 at Raigad’s fall. Held for eighteen years, his education in captivity and later Maratha governance shaped a benevolent ruler. Released in 1707 under a Peshwa-brokered treaty, he claimed the throne against Tarabai’s faction, reigning from 1708 to 1749.\n\nDescribed as calm and dignified, Shahu delegated military and administrative power to the Peshwas, stabilizing the empire. His court at Satara fostered the Chauth and Sardeshmukhi systems, funding expansion. Dying in 1749 without heirs, his reign marked the transition to Peshwa dominance, a legacy of conciliation.\n\n**Sources**: Grant Duff’s *History of the Mahrattas* (1826), Sen’s *History of the Maratha Navy* (1940).",
            "image": "images/ch_shahu_maharaj.jpg"
        },
        {
            "title": "Chhatrapati Shivaji II",
            "content": "Born in 1696 to Rajaram Maharaj and Tarabai Mohite, Chhatrapati Shivaji II’s life was shaped by his mother’s regency amid Mughal threats. With little formal education, his youth was spent in Deccan forts, Tarabai’s wisdom his guide. A nominal king, his brief reign from 1700 to 1712 under regency symbolized continuity.\n\nIllness claimed him in 1712, his administration a reflection of Tarabai’s leadership, focusing on fort defense. Though his story is brief, his presence upheld Maratha resilience.\n\n**Sources**: Kincaid and Parasnis’ *A History of the Maratha People* (1918), Sarkar’s *House of Shivaji* (1940).",
            "image": "images/ch_shivaji_ii.jpg"
        },
        {
            "title": "Maharani Tarabai",
            "content": "Born in 1675 to Hambirrao Mohite, a general under Shivaji, Tarabai’s childhood in military camps honed her in warfare and strategy. Marrying Rajaram in 1686, she became regent for Shivaji II in 1700 after Rajaram’s death. Leading from Jinji, Vishalgad, and Kolhapur, she defied Mughals and rival Shahu, retiring in 1751 after a peace treaty, dying in 1761.\n\nPortrayed as robust with a piercing gaze, her courage shone in rallying troops during sieges. Her administration mirrored the *Ashta Pradhan* council, fortifying defenses and levying Chauth. Known as the “Iron Queen,” her legacy empowered women in leadership.\n\n**Sources**: Grant Duff’s *History of the Mahrattas* (1826), Tarlekar’s *Tarabai and Her Times* (1958).",
            "image": "images/tarabai.webp"
        },
        {
            "title": "Peshwa Balaji Vishwanath",
            "content": "Born in 1662 to a Chitpavan Brahmin family, Balaji Vishwanath’s diplomacy elevated the Peshwa role. Appointed in 1713 by Shahu, he secured Shahu’s 1719 release from Mughal captivity. Dying in 1720, his revenue reforms laid the Peshwa foundation.\n\nA shrewd scholar, his legacy transformed governance, shifting power to the Bhat family.\n\n**Sources**: Grant Duff’s *History of the Mahrattas* (1826), Sen’s *History of the Maratha Navy* (1940).",
            "image": "images/balaji_vishwanath.jpg"
        },
        {
            "title": "Peshwa Bajirao I",
            "content": "Born in 1700 to Balaji Vishwanath, Bajirao I’s cavalry mastery earned him the “Thunderbolt” title. Appointed Peshwa in 1720, he conquered Bhopal (1727), Malwa (1731), Vasai (1737), and raided Delhi (1739), dying in 1740. His romance with Mastani and patronage of arts enriched Maratha culture.\n\nOver six feet tall with a sharp gaze, his administration expanded the empire, founding a confederacy.\n\n**Sources**: Grant Duff’s *History of the Mahrattas* (1826), Gokhale’s *Bajirao I* (1978).",
            "image": "images/bajirao_i.webp"
        },
        {
            "title": "Peshwa Balaji Bajirao (Nanasaheb)",
            "content": "Born in 1721 to Bajirao I, Nanasaheb consolidated the empire from 1740, peaking in 1751 with northern control. The 1761 Panipat defeat led to his death. His infrastructure projects, like Pune’s development, left a cultural mark.\n\nA thoughtful leader, his reign balanced stability and decline.\n\n**Sources**: Grant Duff’s *History of the Mahrattas* (1826), Sen’s *History of the Maratha Navy* (1940).",
            "image": "images/nanasaheb.jpg"
        },
        {
            "title": "Peshwa Madhavrao I",
            "content": "Born in 1745 to Balaji Bajirao, Madhavrao I restored Maratha glory from 1761, defeating the Nizam (1767–1772). Tuberculosis claimed him in 1772. His balanced leadership revived finances and alliances.\n\nYouthful and wise, his legacy influenced anti-British resistance.\n\n**Sources**: Grant Duff’s *History of the Mahrattas* (1826), Kincaid and Parasnis’ *A History of the Maratha People* (1918).",
            "image": "images/madhavrao_i.jpg"
        },
        {
            "title": "Rise of the Maratha Empire",
            "content": "The Maratha Empire rose on June 6, 1674, with Shivaji’s coronation at Raigad, defying Mughal rule. His guerrilla tactics and navy laid the foundation, sustained by Sambhaji, Rajaram, Shahu, and Tarabai’s regency. The Peshwas, from Balaji Vishwanath to Bajirao 1st and Nanasaheb, expanded it to northern India by 1760. The 1761 Panipat defeat and internal strife paved the way for British dominance by 1818.\n\n**Sources**: Sabhasad Bakhar (1697), Sarkar’s *Shivaji and His Times* (1919).",
            "image": "images/maratha_empire_rise.webp"
        },
        {
            "title": "Hindavi Swarajya Milestones",
            "content": "Hindavi Swarajya began in 1645 with Torna Fort’s capture, grew with Pratapgad (1659), Surat (1664), and Raigad’s coronation (1674). It endured through ch.Sambhaji Maharaj's martyrdom (1689),ch. Rajaram’s Jinji resistance (1690–1700), Tarabai’s Kolhapur court (1707), and Peshwa expansions (1720–1760), fading after Panipat (1761) and British rule (1818).\n\n**Sources**: Sabhasad Bakhar (1697), Grant Duff’s *History of the Mahrattas* (1826).",
            "image": "images/hindavi_swarajya.jpg"
        },
        {
            "title": "Maratha Warfare & Military Strategy",
            "content": "Maratha warfare evolved from  chhtrapati Shivaji Maharaj's 1645 Torna capture, blending mobility and deception, peaking at Pratapgad (1659) and Bhopal (1727). Cavalry, infantry, navy, artillery, and intelligence synergized under Bajirao 1st and Madhavrao 1st, though Panipat (1761) exposed limits.\n\n**Sources**: Sen’s *Military System of the Marathas* (1928), Sarkar’s *House of Shivaji* (1940).",
            "image": "images/maratha_warfare.jpg"
        },
        {
            "title": "Ashta Pradhan Mandal (8-Pillared Council)",
            "content": "Instituted in 1674 at Raigad, the Ashta Pradhan council balanced military and administrative roles, adapting through Mughal sieges and Peshwa rule until 1772, despite Panipat’s strain.\n\n**Sources**: Sabhasad Bakhar (1697), Grant Duff’s *History of the Mahrattas* (1826).",
            "image": "images/ashta_pradhan.jpg"
        },
        {
            "title": "Army Divisions (Infantry, Cavalry, Navy, Artillery, Intelligence)",
            "content": "From 1645, Mavali infantry, Bargir cavalry, a 1660s navy, growing artillery, and spies shaped Maratha might, peaking under Bajirao 1st and fading post-1761.\n\n**Sources**: Sen’s *Military System of the Marathas* (1928), Grant Duff’s *History of the Mahrattas* (1826).",
            "image": "images/maratha_army.jpg"
        },
        {
            "title": "Guerrilla Warfare Techniques",
            "content": "Born in 1645 at Torna, *ganimi kava* peaked at Pratapgad (1659) and Bhopal (1727), adapting through Tarabai’s regency and Peshwa Madhavrao I’s era, tested at Panipat (1761).\n\n**Sources**: Sen’s *Military System of the Marathas* (1928), Sarkar’s *Shivaji and His Times* (1919).",
            "image": "images/guerrilla_warfare.jpg"
        },
        {
            "title": "Naval Power and Shipbuilding",
            "content": "Launched in 1660s at Kalyan, the navy grew to 200+ ships by 1772, clashing with Siddis and Portuguese, declining after Panipat.\n\n**Sources**: Sen’s *History of the Maratha Navy* (1940), Grant Duff’s *History of the Mahrattas* (1826).",
            "image": "images/maratha_navy.jpg"
        },
        {
            "title": "Economic Systems",
            "content": "Shivaji’s Chauth and Sardeshmukhi levies funded the empire, expanded by Peshwas into a confederacy-wide revenue system, sustaining trade and war until British interference.\n\n**Sources**: Grant Duff’s *History of the Mahrattas* (1826), Sarkar’s *Shivaji and His Times* (1919).",
            "image": "images/economic_systems.jpg"
        },
        {
            "title": "Religious Practices",
            "content": "Blending Hindu traditions with tolerance, Shivaji’s coronation (1674) and temple patronage (Jejuri) reflected Maratha faith, evolving under Peshwa cultural support.\n\n**Sources**: Sabhasad Bakhar (1697), Fergusson’s *History of Indian and Eastern Architecture* (1876).",
            "image": "images/religious_practices.jpg"
        },
        {
            "title": "Foreign Relations",
            "content": "Alliances with Qutb Shahi (1678), treaties with Mughals (1719), and conflicts with Portuguese (1737) shaped Maratha diplomacy, tested by British rivalry post-1761.\n\n**Sources**: Grant Duff’s *History of the Mahrattas* (1826), Sen’s *History of the Maratha Navy* (1940).",
            "image": "images/foreign_relations.jpg"
        },
        {
            "title": "Family Trees and Timeline",
            "content": "From Shahaji and Jijabai (1605) to Shivaji’s heirs (1674–1712) and Peshwa lines (1713–1772), the Bhosale and Bhat families charted Maratha history until 1818.\n\n**Sources**: Kincaid and Parasnis’ *A History of the Maratha People* (1918), Sarkar’s *House of Shivaji* (1940).",
            "image": "images/family_tree.jpg"
        },
        {
            "title": "Dynasty Chart with Successions and Branches",
            "content": "Shahaji’s line birthed Shivaji’s successions (Sambhaji, Rajaram), branching to Shahu and Shivaji II, while Peshwas (Balaji to Madhavrao) and collaterals (Holkars, Scindias) extended the dynasty to 1818.\n\n**Sources**: Sabhasad Bakhar (1697), Grant Duff’s *History of the Mahrattas* (1826).",
            "image": "images/dynasty_chart.jpg"
        },
        {
            "title": "Architecture Beyond Forts",
            "content": "From Raigad’s 1674 palace to Shaniwar Wada (1730) and Aundh temples (1750), Maratha architecture blended functionality with art, sustained by water systems until 1818.\n\n**Sources**: Fergusson’s *History of Indian and Eastern Architecture* (1876), Grant Duff’s *History of the Mahrattas* (1826).",
            "image": "images/architecture_beyond_forts.jpg"
        }
    ],
    "key_rulers": [
        "Chhatrapati Shivaji Maharaj",
        "Chhatrapati Sambhaji Maharaj",
        "Chhatrapati Rajaram Maharaj",
        "Chhatrapati Shahu Maharaj",
        "Chhatrapati Shivaji II",
        "Maharani Tarabai",
        "Peshwa Balaji Vishwanath",
        "Peshwa Bajirao I",
        "Peshwa Balaji Bajirao",
        "Peshwa Madhavrao I",
        "Peshwa Narayanrao",
        "Peshwa Sawai Madhavrao"
    ],
    "key_battles": [
        "Battle of Pratapgad (1659)",
        "Battle of Bhopal (1727)",
        "Siege of Vasai (1737)",
        "Third Battle of Panipat (1761)",
        "Battle of Trimbak (1671)",
        "Battle of Sinhagad (1670)"
    ],
    "cultural_contributions": [
        "Shaniwar Wada",
        "Jejuri Temples",
        "Maratha Navy",
        "Sabhasad Bakhar",
        "Budhbhushan Grantha",
        "Aundh Temples",
        "Marathi Literature"
    ],
    "additional_image": "images/maratha_additional.jpg"
}