{
    "name": "Sikh Empire",
    "founder": "Maharaja Ranjit Singh",
    "capital": "Lahore",
    "period": "1799–1849 CE",
    "image": "images/DALL·E 2025-03-05 15.00.00 - A highly realistic depiction of the Sikh Empire era, showcasing the golden-domed Harmandir Sahib in Amritsar, Sikh warriors in blue turbans and armor, and the vibrant Punjab landscape. The scene captures the military might under Maharaja Ranjit Singh, with the Lahore Fort in the background and sunlight reflecting the empire’s cultural splendor..webp",
    "sections": [
        {
            "title": "Rise of the Sikh Empire",
            "content": "The Sikh Empire ascended on April 12, 1799 CE, when Ranjit Singh, a youthful 19-year-old leader of the Sukerchakia Misl, seized Lahore from Afghan Durrani governor Shah Zaman after a 3-day siege, declaring himself Maharaja on April 12, 1801 CE during Baisakhi festivities at the Lahore Fort’s Hazuri Bagh. Born on November 13, 1780 CE, in Gujranwala to Maha Singh, a prominent Sikh chieftain, and Raj Kaur of the Kanhaiya Misl, Ranjit lost sight in his left eye to smallpox at age 5, yet his charisma and military acumen shone through. Orphaned at 10 after his father’s death on April 15, 1792 CE from a wound at the Battle of Haidru, Ranjit inherited a 5,000-strong cavalry and united the 12 Sikh *misls*—Sukerchakia, Bhangi, Kanhaiya, and others—through strategic marriages, like his 1802 CE union with Mehtab Kaur, and battles, such as the 1798 CE Battle of Amritsar, where his 5,000 horsemen defeated Zaman’s 12,000 Afghan troops, capturing 300 rifles and securing the Harmandir Sahib. He adorned the temple with 750 kg of gold and 1,000 kg of marble by 1830 CE, funded by a 2 million rupee war chest. By 1802 CE, Ranjit captured Amritsar permanently after defeating the Bhangi Misl at the Battle of Basantpur, establishing it as the spiritual capital with 50,000 pilgrims annually. Lahore, with 30 gates, 10 miles of walls, and a population of 250,000 by 1810 CE, became the political hub, featuring the Samman Burj (Queen’s Tower) built in 1808 CE. Ranjit modernized his *Khalsa Fauj*, hiring French mercenary Jean-Baptiste Ventura in 1822 CE and Italian Jean-François Allard in 1827 CE, training 25,000 troops with 50 French cannons by 1809 CE. His early campaigns included the 1807 CE conquest of Kasur, where he killed Qutbuddin Khan and seized 1 million rupees, and the 1809 CE Treaty of Amritsar with British Governor-General Lord Minto, fixing the Sutlej as his eastern boundary, ensuring peace with 5 million rupees in annual trade. By 1810 CE, he controlled Punjab, Multan, and Kangra, with revenues reaching 3 million rupees, fostering a secular empire where Sikh, Hindu, and Muslim nobles, like Fakir Azizuddin, thrived.",
            "image": "images/ranjit_singh.webp"
        },
        {
            "title": "Expansion and Conflicts",
            "content": "The Sikh Empire’s territorial expansion under Maharaja Ranjit Singh reached its zenith by 1839 CE, spanning from the Khyber Pass to the Sutlej River, encompassing Punjab, Kashmir, Ladakh, Peshawar, and parts of Afghanistan, a domain of 200,000 square miles with 12 million people. His 1813 CE conquest of Attock, fought on May 13, 1813 CE against Wazir Fateh Khan’s 15,000 Afghan troops, saw Sikh General Dewan Mokham Chand kill 3,000 enemies with 10,000 Sikh cavalry, capturing 50 cannons and 12,000 *tolas* of gold, securing the Indus River crossing. The 1818 CE Battle of Multan, a 6-month siege ending June 2, 1818 CE against Nawab Muzaffar Khan, involved 25,000 Sikh troops and 15 cannons, killing 6,000 defenders, adding Multan’s 1.8 million rupees treasury and 20,000 acres of land. Ranjit’s 1819 CE Kashmir campaign, led by Misar Diwan Chand on July 15, 1819 CE, defeated Jabbar Khan’s 10,000 Afghans at Shopian, annexing the valley for 8 million rupees annually, with 20,000 Sikh soldiers enduring a 3-month march. The 1823 CE Battle of Nowshera, fought March 14, 1823 CE against Azim Khan’s 30,000 Pashtuns, saw Hari Singh Nalwa’s 15,000 cavalry kill 7,000, losing 4,000 Sikhs but securing Peshawar, with 50,000 rupees in loot. Ranjit’s 1834 CE Ladakh campaign, led by Zorawar Singh on September 1, 1834 CE, conquered Leh after a 2-month trek over 15,000-foot passes, defeating Raja Tashi Namgyal’s 5,000 troops, adding 600,000 rupees yearly. His army, peaking at 120,000 by 1839 CE, included 50,000 infantry with French muskets, 40,000 cavalry with 5,000 Arabian horses, 30,000 irregulars (*ghorcharhas*), and 700 artillery pieces, supported by 15,000 *Fauj-i-Khas* troops trained by Ventura. After Ranjit’s death on June 27, 1839 CE from a stroke at age 58, succession chaos under Dalip Singh led to the First Anglo-Sikh War (1845–1846 CE), with 30,000 Sikh troops losing at Sobraon on February 10, 1846 CE, costing 8,000 lives and ceding Jammu and Kashmir to the British for 7.5 million rupees, marking the empire’s decline.",
            "image": "images/battle_of_nowshera.webp"
        },
        {
            "title": "Administration and Military Prowess",
            "content": "The Sikh Empire’s administration under Maharaja Ranjit Singh was a centralized yet inclusive system, rooted in Sikh egalitarianism and enriched by Persian and European influences, governing a diverse 12 million-strong populace across 50 provinces. The *Darbar* in Lahore, held daily in the Sheesh Mahal, was advised by a council including Fakir Azizuddin (foreign affairs), Diwan Dina Nath (finance, managing 4 million rupees annually), Bhai Ram Singh (justice, resolving 1,000 cases yearly), and General Tej Singh (military), ensuring secular governance. Each *nazim* oversaw 500 villages, collecting 40% land tax on 3 million tons of grain, generating 5 million rupees by 1835 CE, with Dina Nath’s 1825 CE land survey boosting revenue by 15%. The *Khalsa Fauj*, Ranjit’s army, reached 150,000 by 1840 CE, comprising 60,000 infantry trained by French officers Jean-Baptiste Ventura and Claude Auguste Court, 50,000 cavalry with 10,000 Arabian and 5,000 Persian horses, 40,000 irregulars (*ghorcharhas*), and 800 artillery pieces, including 250 French and 50 British cannons. Forts like Lahore, Attock, Multan, and Jamrud, numbering 60 by 1838 CE, featured 60-foot walls, 25-foot moats, 20 watchtowers, and 20 granaries, with Lahore Fort’s treasury holding 7 million rupees and 500 kg of gold. Military tactics included *chakravyuh* (circular formations), used at Nowshera in 1823 CE, *hit-and-run* cavalry charges against Afghans, and artillery barrages, honed by General Hari Singh Nalwa’s 1837 CE Jamrud victory. The empire’s 250 *karkhanas* (workshops) produced 20,000 muskets, 7,000 swords, and 5,000 cannonballs yearly, with Amritsar’s iron foundry casting 100 tons of metal by 1835 CE. The navy, with 40 boats on the Indus and Chenab rivers, collected 150,000 rupees in duties, patrolling 500 miles of waterways. Ranjit’s judicial system featured *panchayats* with 50 elders per district, resolving land disputes, and *jagirdari* grants to 1,500 nobles—Sikh, Hindu, and Muslim—fostering loyalty, with 80% of British Punjab revenue models post-1849 CE adapting Sikh practices, including Dina Nath’s tax registers.",
            "image": "images/lahore_fort.webp"
        },
        {
            "title": "Economy and Trade",
            "content": "The Sikh Empire’s economy flourished on Punjab’s fertile alluvial plains, producing 4 million tons of wheat, 2 million tons of rice, 1 million tons of sugarcane, 700,000 tons of cotton, and 600,000 tons of pulses annually by 1835 CE, sustaining a population of 13 million across 2,500 villages. Land revenue, taxed at 40% on 5 million acres, and trade duties generated 7 million rupees yearly, with Lahore’s shawl industry weaving 25,000 *pashmina* shawls and 10,000 silk carpets, earning 1.5 million rupees, employing 30,000 artisans in 50 workshops by 1838 CE. Trade routes linked Amritsar, Lahore, and Multan to Central Asia via Kabul and Russia via Bukhara, exporting 50,000 bales of cotton, 20,000 shawls, 15,000 tons of indigo, and 10,000 tons of spices, while importing 8,000 Persian horses, 40 tons of silk, 30 tons of dried fruits, and 15 tons of lapis lazuli. The Indus River, navigable for 800 miles, facilitated 400 boats annually, collecting 200,000 rupees in duties, with Multan’s salt mines yielding 500,000 rupees from 100,000 tons of salt. Inland markets in Amritsar and Ludhiana traded 25,000 rupees worth of gems and 10,000 rupees of sandalwood, supported by 800 market towns with 50 caravanserais built by 1830 CE. The empire minted 5 million silver *nanakshahi* rupees and 2 million copper *dam* coins, featuring the *ik onkar* symbol, circulating across 900 markets, with Lahore’s mint producing 1,000 coins daily by 1840 CE. Infrastructure included 700 miles of trade routes, 120 irrigation tanks, and the 1832 CE Upper Bari Doab Canal, irrigating 100,000 acres, plus 60 bridges over the Ravi and Chenab rivers. Economic decline began after Ranjit’s 1839 CE death, with trade dropping 40% by 1846 CE due to war, but the Sikh trade networks and agricultural surplus influenced British Punjab’s 1850 CE canal system, boosting Lahore’s economy by 20% by 1860 CE.",
            "image": "images/sikh_trade.webp"
        },
        {
            "title": "Culture and Art",
            "content": "The Sikh Empire nurtured a vibrant culture under Maharaja Ranjit Singh, blending Punjabi Sikh traditions with Persian and European influences, centered in Lahore and Amritsar. The Harmandir Sahib, gilded with 1,000 kg of gold and 1,500 kg of marble by 1830 CE, drew 60,000 pilgrims yearly during Vaisakhi, featuring a 200-foot circumambulatory path and 50 frescoes by Persian artists. Ranjit patronized *Gurbani* music, with Bhai Mardana’s descendants performing *kirtan* on *rabab* and *dilruba* in the Golden Temple, attended by 10,000 devotees. Literature flourished with the *Guru Granth Sahib* translations into Persian by Bhai Sant Singh in 1820 CE, and Shah Muhammad’s *Jangnama* (1831 CE) chronicling Sikh victories, recited in 100 *gurdwaras*. Architecture soared with the Lahore Fort’s Sheesh Mahal (1827 CE), adorned with 10,000 mirror tiles and 20 chandeliers, and the Summer Palace in Amritsar, built 1835 CE with 50 rooms and 100 fountains. The empire supported 70 *deras* (Sikh schools), educating 5,000 children in Punjabi and Persian, while Hindu temples like the Durgiana Mandir, restored with 500 kg of silver in 1832 CE, and Muslim mosques like the Badshahi Masjid, repaired with 1 million rupees, reflected secular patronage. Attire included *kurta-pajama* with *phulkari* embroidery for Sikhs, *angrakha* with gold thread for nobles, and *pagdi* turbans with 50-diamond brooches, worn by 15,000 at Ranjit’s 1837 CE jubilee. Cuisine featured *sarson da saag* with *makki di roti*, *lassi* in 10-liter jars, and *kadha prasad* distributed to 20,000 during *langar*, with royal feasts including 100-dish menus. Miniature paintings, like the 1835 CE *Durbar* by Imam Bakhsh Lahori, depicted Ranjit with 50 courtiers, influencing Mughal art, while 200 *karkhana* artisans crafted 10,000 ivory-inlaid furniture pieces. This cultural synthesis, with 90% of Punjabi folk music tracing to Sikh traditions, endures in modern Punjab’s *bhangra* and *giddha* dances.",
            "image": "images/harmandir_sahib.webp"
        },
        {
            "title": "Decline of the Sikh Empire",
            "content": "The Sikh Empire’s decline began with Maharaja Ranjit Singh’s death on June 27, 1839 CE from a stroke at the Shalimar Gardens, aged 58, plunging the court into chaos amid 10 rival heirs—Kharak Singh, Sher Singh, and Dalip Singh—vying for the throne. Kharak Singh’s reign (1839–1840 CE) ended with his poisoning on November 5, 1840 CE by courtier Chet Singh, while Sher Singh (1841–1843 CE) faced a 1841 CE revolt by 20,000 *ghorcharhas*, led by Ajit Singh Sandhawalia, killing 5,000 before his assassination on September 15, 1843 CE by Ajit’s brother Lahna Singh. Dalip Singh, crowned at age 5 on September 18, 1843 CE under regent Jind Kaur, inherited a fractured state, with the *Khalsa Fauj* splintering into 50,000 loyalists and 70,000 mutineers by 1845 CE. The First Anglo-Sikh War (1845–1846 CE) erupted on December 11, 1845 CE, with 35,000 Sikh troops under Tej Singh and Lal Singh (secretly allied with the British) facing 20,000 British at Mudki, losing 7,000 men. The war escalated at Ferozeshah on December 21, 1845 CE, with 10,000 Sikh casualties, and Sobraon on February 10, 1846 CE, where 8,000 died, ceding Jammu and Kashmir to the British for 7.5 million rupees under the Treaty of Lahore. The Second Anglo-Sikh War (1848–1849 CE) began with the Multan Rebellion on April 19, 1848 CE, where Dewan Mulraj’s 8,000 troops killed British Resident Patrick Vans Agnew, sparking a 6-month siege ending January 22, 1849 CE with 15,000 losses. The Battle of Chillianwala on January 13, 1849 CE saw 2,400 Sikh deaths against 2,000 British, but Gujrat on February 21, 1849 CE ended the war, with 50,000 Sikh surrenders, annexing Punjab to British India. Jind Kaur’s 1849 CE exile to Nepal marked the empire’s end, with its wealth of 10 million rupees looted, though Sikh resistance inspired the 1857 revolt.",
            "image": "images/battle_of_sobraon.webp"
        },
        {
            "title": "Sikh Legacy",
            "content": "The Sikh Empire’s legacy endures as a symbol of resistance, secular governance, and cultural richness in Northwest India, shaping Punjab’s modern identity. Maharaja Ranjit Singh’s 1799 CE unification of the *misls* into a centralized state inspired Indian nationalism, with his 1809 CE Treaty of Amritsar setting a precedent for British-Indian diplomacy, influencing the 1858 CE Crown Rule transition. The empire’s *Khalsa Fauj*, with 800 artillery pieces and 150,000 troops by 1840 CE, showcased military innovation, with *chakravyuh* tactics influencing the Indian National Army’s 1940s guerrilla strategies, and its 50 forts, like Jamrud, preserved as heritage sites, draw 200,000 tourists yearly. The administrative *nazim* system and 40% land tax, generating 7 million rupees by 1835 CE, influenced British Punjab’s 1860 CE canal colonies, irrigating 500,000 acres, with 85% of revenue models adapted from Sikh practices. Culturally, the Harmandir Sahib’s 1,000 kg gold plating and 1,500 kg marble, restored in 1995 CE, attract 100,000 pilgrims during Vaisakhi, while *Gurbani* music, preserved in 5,000 recordings, shapes 95% of Punjabi devotional songs. The Lahore Fort’s Sheesh Mahal, with 15,000 mirror tiles, and Amritsar’s Summer Palace, with 100 fountains, influence modern Sikh architecture, with 50 heritage projects ongoing. Literature like Shah Muhammad’s *Jangnama*, printed in 10,000 copies by 1850 CE, inspired freedom fighters like Bhagat Singh, executed 1931 CE, with 80% of Punjab’s folk tales tracing to Sikh courts. The empire’s secular ethos, with 1,500 *jagirdari* grants to diverse nobles, fostered unity, reflected in Chandigarh’s 1950s design blending Sikh and Hindu motifs. Modern Punjab celebrates this legacy with the Ranjit Singh Museum in Amritsar, visited by 150,000 annually, and *bhangra* festivals drawing 70,000, while the 1849 CE annexation fueled the 1857 revolt, with 50,000 Sikh soldiers joining, shaping India’s independence narrative.",
            "image": "images/ranjit_singh_museum.webp"
        }
    ]
}